#include "stdio.h"
#include "windows.h"
#include "conio.h"
#include "mydll.h"

#define	Red			 4;
#define Yellow       14;

//1, тест sponge bob
__declspec(dllexport) void f1() {
	system("chcp 866>nul");
	int fDig,
		sDig,
		thDig,
		fvDig;

	printf("В этом тесте ты узнаешь кто ты из мультика Спанч Боб\n");
	printf("------------------------------------------------------\n");

	printf("\t\tКакой цвет тебе нравится больше?\n");
	printf("Желтый (1) \t Синий(2)\n");
	scanf_s("%d", &fDig);


	printf("\t\tКакой из видов отдыха ты выберешь?\n");
	printf("Экстримальный, подвижный (1) \t Тихий спокойный отдых\n");
	scanf_s("%d", &sDig);


	printf("\t\tКак у тебя со спортом?\n");
	printf("Спорт - моя стихия! \t Я в спорте полный ноль\n");
	scanf_s("%d", &thDig);


	printf("\t\tКто ты в отношении работы?\n");
	printf("Ленивый \t Трудоголик\n");
	scanf_s("%d", &fvDig);


	if (fDig == 1 && sDig == 2 && thDig == 2 && fvDig == 2) {
		printf("Ты Спанч Боб!\n");
	
	}
	else if (fDig == 1 && sDig == 1 && thDig == 2 && fvDig == 2) {
		printf("Ты Спанч Боб!\n");
		
	}
	else if (fDig == 2 && sDig == 2 && thDig == 2 && fvDig == 2) {
		printf("Ты Спанч Боб!\n");

	}
	else if (fDig == 1 && sDig == 1 && thDig == 1 && fvDig == 2) {
		printf("Ты Патрик!\n");

	}
	else if (fDig == 1 && sDig == 1 && thDig == 1 && fvDig == 1) {
		printf("Ты Патрик!\n");
	
	}
	else if (fDig == 2 && sDig == 1 && thDig == 1 && fvDig == 2) {
		printf("Ты Патрик!\n");
	
	}
	else if (fDig == 1 && sDig == 2 && thDig == 1 && fvDig == 2) {
		printf("Ты Патрик!\n");
		
	}
	else if (fDig == 1 && sDig == 2 && thDig == 1 && fvDig == 2) {
		printf("Ты Патрик!\n");
		
	}
	else if (fDig == 2 && sDig == 1 && thDig == 2 && fvDig == 1) {
		printf("Ты Патрик!\n");
		
	}
	else if (fDig == 1 && sDig == 2 && thDig == 2 && fvDig == 1) {
		printf("Ты Патрик!\n");
	
	}
	else if (fDig == 2 && sDig == 2 && thDig == 1 && fvDig == 2) {
		printf("Ты Патрик!\n");
		
	}
	else if (fDig >= 2 && sDig >= 2 && thDig >= 2 && fvDig >= 2) {
		printf("Попробуй еще раз\n");
	}

	system("pause");

}


//2, графика спанч боб
__declspec(dllexport) void f2() {
	system("cls");
	HANDLE Console = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 14);
	printf("ТЫ Снанч Боб Квадратные Штаны!\n"
"      .--..--..--..--..--..--.\n"
"    .' \  (`._   (_)     _   \ \n"
"  .'    |  '._)         (_)  | \n"
"  \ _.')\      .----..---.   / \n"
"  |(_.'  |    /    .-\-.  \  | \n"
"  \     0|    |   ( O| O) | o| \n"
"   |  _  |  .--.____.'._.-.  | \n"
"   \ (_) | o         -` .-`  | \n"
"    |    \   |`-._ _ _ _ _\ / \n"
"    \    |   |  `. |_||_|   | \n"
"    | o  |    \_      \     |     -.   .-. \n"
"    |.-.  \     `--..-'   O |     `.`-' .' \n"
"  _.'  .' |     `-.-'      /-.__   ' .-' \n"
".' `-.` '.|='=.='=.='=.='=|._/_ `-'.' \n"
"`-._  `.  |________/\_____|    `-.' \n"
"   .'   ).| '=' '='\/ '=' | \n"
"   `._.`  '---------------' \n"
"           //___\   //___\ \n"
"             ||       || \n"
"             ||_.-.   ||_.-. \n"
"            (_.--__) (_.--__) \n"
"------------------------------------------------");

	
				
}
//3, патрик
__declspec(dllexport) void f3() {
	system("cls");
	HANDLE Console = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), 4);
	printf("ТЫ Патрик!\n");
	printf(" _______________________$$$$ \n"
		"_____________________$$____$ \n"
		"____________________$______$ \n"
		"___________________$_______$ \n"
		"__________________$________$ \n"
		"_________________$____$__$_$ \n"
		"________________$_________$$ \n"
		"________________$_____$$___$ \n"
		"_______________$______$$$$__$$ \n"
		"_______________$_____$____$$__$ \n"
		"______________$_____$$$$$$$$$$$ \n"
		"______________$_____$______$___$ \n"
		"______________$______$___o_$_o_$ \n"
		"______________$_______$___$$___$ \n"
		"_____________$___$$____$$$__$$$$ \n"
		"____________$______$$$$$$$$$$$$$$$ \n"
		"_________$$$____________________$ \n"
		"_______$$________________________$$$ \n"
		"_____$$___________________________$_$$ \n"
		"____$______$$________________$$____$__$$ \n"
		"__$$________________________________$___$$ \n"
		"_$___________$_______________________$____$ \n"
		"_$__________$_____________$$________$_$____$ \n"
		"$_________$$___________________________$__$_$ \n"
		"$_______$$_____________________________$___$_$ \n"
		"$_$____$__________________________$$$__$$____$ \n"
		"$_____$$$$$$_________________________$$$_$$$$ \n"
		"_$$__$_$____$$$$$$$$$$_________$$$$$$$$$ \n"
		"___$$___$_____________$$$$$$$$$_______$$ \n"
		"_________$$________________$__$$___$$$_$ \n"
		"_________$$_________________$$_$____$_$ \n"
		"_________$$$$$_________$________$$$___$ \n"
		"_________$$___$________$$$$__________$ \n"
		"__________$$$$_____$$$$____$$$$$$$$$$ \n"
		"___________$$_$$$$$__$______$____$_$ \n"
		"____________$$______$________$__$_$ \n"
		"______________$$$$$$__________$$$$ \n");
}



			 
